app/controllers/subscriptions_controller.rb

SELECT "subscriptions".* FROM "subscriptions"
---
  def index
    @subscriptions = Subscription.all

SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @subscription = Subscription.find(params[:id])

SELECT "subscription_plans".* FROM "subscription_plans" WHERE "subscription_plans"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    plan = SubscriptionPlan.find(params[:subscription_plan_id])

INSERT INTO "subscriptions" ("created_at", "email", "subscription_plan_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 22 Jun 2013 11:51:49 UTC +00:00], ["email", "tahniyat@sprd.co"], ["subscription_plan_id", 2], ["updated_at", Sat, 22 Jun 2013 11:51:49 UTC +00:00]]
---
  def create
    @subscription = Subscription.new(params[:subscription])
    if @subscription.save_with_payment