app/controllers/subscription_plans_controller.rb

  def index
    @subscription_plans = SubscriptionPlan.all
---
SELECT "subscription_plans".* FROM "subscription_plans"